import { Container } from './styles';

export function Deal() {
    return (
        <Container>
            <div className="main">
                <div className="dealHead">
                    <div className="log"></div>
                    <h3 className="title">盈嘉互联用户协议</h3>
                </div>
                <div className="dealContant">
                    <p className="level2">
                        {' '}
                        《盈嘉互联用户协议》（以下简称“本协议”）是由盈嘉互联（北京）科技有限公司（以下简称“盈嘉互联”）与您（包含注册、登录、使用、浏览盈嘉互联产品、服务的个人或组织）之间所订立的协议。
                        您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。
                    </p>
                    <p className="level2">
                        您对本协议的接受即自愿接受全部条款的约束，包括接受盈嘉互联对任一服务条款随时所做的任何修改。盈嘉互联有权对本协议包含的条款随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，您可在本网站查阅最新版协议条款。
                        在盈嘉互联修改本协议相关条款之后，若您不接受修改后的条款，请停止使用盈嘉互联提供的产品和服务，您继续使用盈嘉互联提供的产品和服务将被视为您已接受了修改后的协议。
                    </p>
                    <p className="level1">1．注册与账号</p>
                    <p className="level2">
                        1.1
                        盈嘉互联账号的所有权归盈嘉互联，您完成注册手续后，获得盈嘉互联账号的使用权。您应提供及时、详尽及准确的个人资料，并不断更新注册资料，符合及时、详尽准确的要求。
                    </p>
                    <p className="level2">
                        1.2
                        您须对注册信息的真实性、合法性、有效性承担全部责任；不得冒充他人，不得利用他人的名义发布任何信息；不得恶意使用注册账号导致其他用户误认；否则盈嘉互联有权立即停止提供服务，由您独自承担由此而产生的一切法律责任。
                    </p>
                    <p className="level2">
                        1.3
                        您使用盈嘉互联产品、服务的行为必须合法，您必须为自己注册账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何结果。您应对其中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。
                        盈嘉互联无法且不会对因您行为而导致的任何损失或损害承担责任。
                    </p>
                    <p className="level2">
                        1.4
                        您须对自己的登录信息保密、不被其他人获取并使用，并且对您在本网站账户下的所有行为负责。您必须将任何有可能触犯法律的，未授权使用或怀疑为未授权使用的行为在第一时间通知盈嘉互联，盈嘉互联不对您因未能遵守上述要求而造成的损失承担责任。
                    </p>
                    <p className="level2">
                        1.5
                        您不应将您的账号、密码转让、出售或出借予他人使用，若您授权他人使用账户，应对被授权人在该账号下发生所有行为负全部责任。
                    </p>
                    <p className="level2">
                        1.6
                        如果您在盈嘉互联提供网络服务的平台上传或发布任何文字、图片、音频、视频、文件或其他内容（合称“上传文件或内容”），则您保证：
                    </p>
                    <p className="level3">
                        1.6.1您所上传文件或内容均由您本人原创或已经依法获得原始权利人合法授权，不存在侵犯第三方知识产权的情况；
                    </p>
                    <p className="level3">
                        1.6.2
                        您有权授权盈嘉互联依据本协议或其他相关规则使用您所上传文件或内容；
                    </p>
                    <p className="level3">
                        1.6.3
                        您所上传文件或内容符合国家相关法律法规和公序良俗，不会损害任何他方的合法权益或造成不良社会影响；
                    </p>
                    <p className="level3">
                        1.6.4
                        盈嘉互联依照本协议或其他相关规则使用您所上传文件或内容，无须另行获得第三方同意或对第三方承担任何责任。
                    </p>
                    <p className="level2">
                        1.7
                        对于用户上传文件或内容，盈嘉互联不保证其合法性、正当性、准确性、完整性。用户在接受盈嘉互联服务后，在任何情况下，盈嘉互联均不对任何用户上传文件或内容承担任何责任，包括但不限于任何用户上传文件或内容发生任何错误或纰漏以及衍生的任何损失或损害。盈嘉互联有权（但无义务）自行拒绝或删除用户上传文件或内容。盈嘉互联有权在下述情况下，对上传文件或内容进行保存或披露：
                    </p>
                    <p className="level3">
                        1.7.1
                        法律法规规定，法院、仲裁机构、政府部门或其他监管部门要求；
                    </p>
                    <p className="level3">1.7.2 本协议或其他相关规则规定；</p>
                    <p className="level3">1.7.3 被侵害的第三人提出权利主张；</p>
                    <p className="level3">
                        1.7.4
                        为保护盈嘉互联及其关联公司、其合作方、其他第三方以及社会公众的权利、财产或人身安全；
                    </p>
                    <p className="level3">
                        1.7.5 其他盈嘉互联认为有必要的情况。
                    </p>
                    <p className="level1">2．服务内容</p>
                    <p className="level2">
                        2.1
                        盈嘉互联产品服务的具体内容由盈嘉互联根据实际情况提供。盈嘉互联可以对其提供的服务予以变更，且盈嘉互联提供的服务内容可能随时变更；用户将会收到盈嘉互联关于服务变更的通知。
                    </p>
                    <p className="level2">
                        2.2
                        除非本服务协议另有其它明示规定，盈嘉互联所推出的新产品、新功能、新服务，均受到本服务协议之规范。
                    </p>
                    <p className="level2">
                        2.3
                        为使用本服务，您必须能够自行经有法律资格对您提供互联网接入服务的第三方，进入国际互联网，并应自行支付相关服务费用。此外，您必须自行配备及负责与国际联网连线所需之一切必要装备，包括计算机、数据机或其它存取装置。
                    </p>
                    <p className="level2">
                        2.4
                        鉴于网络服务的特殊性，您同意盈嘉互联有权不经事先通知，随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。盈嘉互联不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。
                    </p>
                    <p className="level2">
                        2.5
                        盈嘉互联需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成网络服务（包括收费网络服务）在合理时间内的中断，盈嘉互联无需为此承担任何责任。盈嘉互联保留不经事先通知为维修保养、升级或其它目的暂停本服务任何部分的权利。
                    </p>
                    <p className="level2">
                        2.6
                        本服务或第三人可提供与其它国际互联网上之网站或资源之链接。由于盈嘉互联无法控制这些网站及资源，您了解并同意，此类网站或资源是否可供利用，盈嘉互联不予负责，存在或源于此类网站或资源之任何内容、广告、产品或其它资料，盈嘉互联亦不予保证或负责。
                        因使用或依赖任何此类网站或资源发布的或经由此类网站或资源获得的任何内容、商品或服务所产生的任何损害或损失，盈嘉互联不承担任何责任。
                    </p>
                    <p className="level2">
                        2.7
                        您明确同意其使用盈嘉互联产品和服务所存在的风险将完全由其自己承担。您理解并接受下载或通过盈嘉互联服务取得的任何信息资料取决于您自己，并由您承担系统受损、资料丢失以及其它任何风险。盈嘉互联对在服务网上得到的任何商品购物服务、交易进程、招聘信息，都不作担保。
                    </p>
                    <p className="level2">
                        2.8
                        盈嘉互联有权于任何时间暂时或永久修改或终止本服务（或其任何部分），对您和任何第三人均无需承担任何责任。您同意若本服务之使用被中断或终止或您的帐号及相关信息和文件被关闭或删除，百度对您或任何第三人均不承担任何责任
                    </p>
                    <p className="level1">3．第三方产品和服务</p>
                    <p className="level2">
                        3.1
                        本服务可能包含第三方提供的产品或服务。当用户使用第三方提供的产品或服务时，可能会另有相关的协议或规则，您同样应当认真阅读并遵守。
                    </p>
                    <p className="level2">
                        3.2
                        您须理解并同意：为了向您提供更好的用户体验，当您在使用第三方服务时，第三方可能会接触、使用到您的昵称、头像以及在第三方服务中的相关操作信息
                    </p>
                    <p className="level2">
                        3.3
                        如您在使用第三方产品或服务时发生任何纠纷的，请与第三方直接联系，盈嘉互联不承担任何责任，但根据需要会依法提供必要
                    </p>
                    <p className="level1">4．权利限制</p>
                    <p className="level2">
                        4.1
                        您不得对盈嘉互联的产品、程序及服务（包括但不限于内容或产品中的广告或赞助内容）进行任何形式的许可、出售、租赁、转让、发行或做其他商
                    </p>
                    <p className="level2">
                        4.2
                        您不得以创建相同或竞争服务为目的访问或使用盈嘉互联产品、程序
                    </p>
                    <p className="level2">
                        4.3
                        除非法律明文规定，否则您不得对盈嘉互联产品、程序及服务（包括但不限于内容或产品中的广告或赞助内容）的任何部分以任何形式或方法进行复制、发行、再版、下载、显示、张贴、修改、翻译、合并、利用、分解或反向
                    </p>
                    <p className="level2">
                        4.4
                        您在使用盈嘉互联产品和服务时，必须遵守中华人民共和国相关法律法规的规定，您应同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下
                    </p>
                    <p className="level3">4.4.1 反对宪法所确定的基本原则的；</p>
                    <p className="level3">
                        4.4.2
                        危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
                    </p>
                    <p className="level3">4.4.3 损害国家荣誉和利益的；</p>
                    <p className="level3">
                        4.4.4 煽动民族仇恨、民族歧视、破坏民族团结的；
                    </p>
                    <p className="level3">
                        4.4.5 破坏国家宗教政策，宣扬邪教和封建迷信的；
                    </p>
                    <p className="level3">
                        4.4.6 散布谣言，扰乱社会秩序，破坏社会稳定的；
                    </p>
                    <p className="level3">
                        4.4.7
                        散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
                    </p>
                    <p className="level3">
                        4.4.8 侮辱或者诽谤他人，侵害他人合法权利的；
                    </p>
                    <p className="level3">
                        4.4.9
                        含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；
                    </p>
                    <p className="level3">
                        4.4.10 侵害他人知识产权、商业秘密等合法权利的；
                    </p>
                    <p className="level3">
                        4.4.11
                        含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。
                    </p>
                    <p className="level2">
                        4.5
                        您已同意不在或不利用盈嘉互联产品、程序及服务从事下列行为：
                    </p>
                    <p className="level3">
                        4.5.1
                        上传或发布电脑病毒、蠕虫、恶意代码、故意破坏或改变计算机系统或数据的软件；
                    </p>
                    <p className="level3">
                        4.5.2
                        未授权的情况下，收集其他用户的信息或数据，例如电子邮箱地址等；
                    </p>
                    <p className="level3">
                        4.5.3
                        禁用本网站的网络连接，给本网站造成过度的负担或以其他方式干扰或损害网站服务器和网络链接；
                    </p>
                    <p className="level3">
                        4.5.4
                        在未授权的情况下，尝试访问本网站、服务器或本网站的网络链接；
                    </p>
                    <p className="level3">
                        4.5.5
                        干扰、破坏其它用户正常使用盈嘉互联产品、程序及服务；
                    </p>
                    <p className="level3">
                        4.5.6
                        未经原始权利人授权的情况下，上传或发布他人享有知识产权的任何文字、图片、音频、视频、文件或其他内容；
                    </p>
                    <p className="level3">
                        4.5.7
                        其他中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它行为。
                    </p>
                    <p className="level2">
                        4.6
                        您违反本协议或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，您同意赔偿盈嘉互联与合作公司、关联公司，并使之免受损害。对此，盈嘉互联有权视您的行为性质，采取包括但不限于删除用户发布信息内容、暂停使用许可、终止服务、限制使用、回收盈嘉互联账号、追究法律责任等措施。
                        对恶意注册盈嘉互联账号或利用盈嘉互联账号进行违法活动、捣乱、骚扰、欺骗、其他用户以及其他违反本协议的行为，盈嘉互联有权回收其账号。同时，盈嘉互联公司会视司法部门的要求，协助调查。
                    </p>
                    <p className="level2">
                        {' '}
                        4.7
                        您须对自己在使用盈嘉互联产品和服务过程中的行为承担法律责任。您承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在盈嘉互联首先承担了因您行为导致的行政处罚或侵权损害赔偿责任后，您应给予盈嘉互联等额的赔偿。{' '}
                    </p>
                    <p className="level1">5．风险与免责</p>
                    <p className="level2">
                        基于互联网的开放性和特殊性，盈嘉互联特别提醒您谨慎注意以下风险：
                    </p>
                    <p className="level2">
                        5.1
                        本服务仅提供一个账号管理的平台，您应当对其他用户使用本服务所产生的信息进行独立判断并承担因依赖该内容而引起的所有风险，包括但不限于因对内容的正确性、完整性或实用性的依赖而产生的风险以及因用户个人信息被其他用户获知而带来的风险。您了解并确认，盈嘉互联不对本服务用户之间的纠纷承担任何责任。
                    </p>
                    <p className="level2">
                        5.2
                        请您切勿在使用本服务时透露任何涉及财产、本服务账号及密码等重要信息，否则，由此带来的损失由您自行承担。
                    </p>
                    <p className="level2">
                        5.3
                        由于您或其他用户违反本服务相关规则导致被盈嘉互联依约处理的，可能会对您在本服务中的内容、信息等数据造成影响。
                    </p>
                    <p className="level1">6．不可抗力</p>
                    <p className="level2">
                        6.1
                        您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，盈嘉互联将努力在第一时间与相关单位配合，及时进行修复，但是由此给您造成的损失盈嘉互联在法律允许的范围内免责。
                    </p>
                    <p className="level2">
                        6.2
                        在法律允许的范围内，盈嘉互联对以下情形导致的服务中断或受阻不承担责任：
                    </p>
                    <p className="level3">
                        6.2.1
                        受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；
                    </p>
                    <p className="level3">
                        6.2.2
                        您或盈嘉互联的电脑软件、系统、硬件和通信线路出现故障；
                    </p>
                    <p className="level3">6.2.3 您操作不当；</p>
                    <p className="level3">
                        6.2.4 您通过非盈嘉互联授权的方式使用本服务；
                    </p>
                    <p className="level3">
                        6.2.5 其他盈嘉互联无法控制或合理预见的情形。
                    </p>
                    <p className="level1">7．知识产权</p>
                    <p className="level2">
                        7.1
                        盈嘉互联在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权归盈嘉互联所有，您在使用本服务中所产生的内容的知识产权归您或相关权利人所有。
                    </p>
                    <p className="level2">
                        7.2
                        除另有特别声明外，盈嘉互联提供本服务时所依托软件的著作权、专利权及其他知识产权均归盈嘉互联所有。盈嘉互联在本服务中所使用的“盈嘉互联”、“BIM
                        WINNER”、“盈嘉BOS”、“麦垛”等商业标识，其商标权归盈嘉互联所有。
                    </p>
                    <p className="level2">
                        7.3
                        上述及其他任何本服务包含的内容的知识产权均受到法律保护，未经盈嘉互联、您或相关权利人书面许可，任何人不得以任何形式进行使用或创造相关衍生作品。
                    </p>
                    <p className="level2">
                        7.4
                        除前述规定以外，如果您认为有人复制并在盈嘉互联用户中心上发布您的作品，并已构成对您著作权的侵犯，请及时与我们联系，并提供包含如下信息的书面通知：
                    </p>
                    <p className="level3">
                        7.4.1 证明您作为涉嫌侵权内容所有者的权属证明；
                    </p>
                    <p className="level3">
                        7.4.2 明确的身份证明、住址、联系方式；
                    </p>
                    <p className="level3">
                        7.4.3 涉嫌侵权内容在盈嘉互联用户中心上的位置；
                    </p>
                    <p className="level3">
                        7.4.4 您声称遭受侵犯的著作权作品的描述；
                    </p>
                    <p className="level3">7.4.5 您著作权遭受侵犯的相关证明；</p>
                    <p className="level3">
                        7.4.6
                        在同意承担伪证处罚之后果的前提下，出具书面陈述以声明您在通知中所述内容是准确和真实的。录或与其它产品捆绑使用销售。
                    </p>
                    <p className="level2">
                        7.5
                        用户所上传文件或内容必须确保其拥有相应全部知识产权，或已经获得知识产权权利人及相关法律的授权，且不得侵犯他人知识产权等权利，不违背商业保密协议。盈嘉互联默认所有用户所上传文件或内容已经获得知识产权权利人合法授权。若因发布内容产生法律纠纷，全部责任在于用户本人，盈嘉互联不承担任何法律责任。
                    </p>
                    <p className="level2">
                        7.6
                        如任何个人或单位发现盈嘉互联提供网络服务的平台上存在侵犯其自身合法权益的内容，请及时与盈嘉互联取得联系，并提供具有法律效应的证明材料，以便盈嘉互联及时作出处理。盈嘉互联有权（但无义务）根据实际情况删除相关的内容，并追究相关用户的法律责任。给盈嘉互联或任何第三方造成损失的，侵权用户应负全部责任。
                    </p>
                    <p className="level1">8．服务的变更、中断、终止</p>
                    <p className="level2">
                        8.1
                        盈嘉互联可能会对服务内容进行变更，也可能会中断、中止或终止服务。
                    </p>
                    <p className="level2">
                        8.2
                        如发生下列任何一种情形，盈嘉互联有权不经通知而中断或终止向您提供的服务：
                    </p>
                    <p className="level3">
                        8.2.1
                        根据法律规定您应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；
                    </p>
                    <p className="level3">
                        8.2.2 您违反相关法律法规或本协议的约定；
                    </p>
                    <p className="level3">
                        8.2.3 按照法律规定或主管部门的要求；
                    </p>
                    <p className="level3">
                        8.2.4 出于安全的原因或其他必要的情形。
                    </p>
                    <p className="level3">
                        8.2.5
                        根据约定您使用收费项目。若您未按时足额付费，盈嘉互联有权中断、中止或终止提供服务。
                    </p>
                    <p className="level2">
                        8.3
                        您有责任自行备份存储在本服务中的数据。如果您的服务被终止，盈嘉互联可以从服务器上永久地删除您的数据,但法律法规另有规定的除外。服务终止后，盈嘉互联没有义务向您返还数据。
                    </p>
                    <p className="level1">9．法律适用与管辖</p>
                    <p className="level2">
                        9.1
                        本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。
                    </p>
                    <p className="level2">
                        9.2
                        若您和盈嘉互联之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交盈嘉互联所在地的人民法院管辖。
                    </p>
                    <p className="level2">
                        9.3
                        本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
                    </p>
                    <p className="level1">10．其他</p>
                    <p className="level2">
                        10.1
                        请查阅我们的《隐私条款》，《隐私条款》为本协议效力不可分割的一部分，且与本协议具有同等法律效力。
                    </p>
                    <p className="level2">
                        10.2
                        如果您对本协议或本服务有意见或建议，可与盈嘉互联用户中心客服联系。
                    </p>
                    <p className="level2">10.3 联系方式: </p>
                    <p className="level3">
                        地址：北京市石景山区中关村科技园西山汇16栋1008室
                    </p>
                    <p className="level3">邮编：100041</p>
                    <p className="level3">电话：010-68887512</p>
                    <p className="level3">传真：010-68887512</p>
                    <p className="level3">电子信箱：partner@boswinner.com</p>
                </div>
            </div>
        </Container>
    );
}
